{"class_name": "Functional", "config": {"name": "MFuReCNN_alpha_do_Learning_rate_0.01", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1_DCNN_A_DCNN_B_DCNN_C_DCNN_A_DCNN_B_DCNN_C"}, "registered_name": null, "name": "input_1_DCNN_A_DCNN_B_DCNN_C_DCNN_A_DCNN_B_DCNN_C", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Rescaling", "config": {"name": "rescaling_2_DCNN_A", "trainable": false, "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 224, 224, 3]}, "name": "rescaling_2_DCNN_A", "inbound_nodes": [[["input_1_DCNN_A_DCNN_B_DCNN_C_DCNN_A_DCNN_B_DCNN_C", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Normalization", "config": {"name": "normalization_1_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "invert": false, "mean": null, "variance": null}, "registered_name": null, "build_config": {"input_shape": [null, 224, 224, 3]}, "name": "normalization_1_DCNN_A", "inbound_nodes": [[["rescaling_2_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Rescaling", "config": {"name": "rescaling_3_DCNN_A", "trainable": false, "dtype": "float32", "scale": [2.0896918976428642, 2.1128856368212916, 2.1081851067789197], "offset": 0.0}, "registered_name": null, "build_config": {"input_shape": [null, 224, 224, 3]}, "name": "rescaling_3_DCNN_A", "inbound_nodes": [[["normalization_1_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "stem_conv_pad_DCNN_A", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 224, 224, 3]}, "name": "stem_conv_pad_DCNN_A", "inbound_nodes": [[["rescaling_3_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "stem_conv_DCNN_A", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 225, 225, 3]}, "name": "stem_conv_DCNN_A", "inbound_nodes": [[["stem_conv_pad_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "stem_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 32]}, "name": "stem_bn_DCNN_A", "inbound_nodes": [[["stem_conv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "stem_activation_DCNN_A", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 32]}, "name": "stem_activation_DCNN_A", "inbound_nodes": [[["stem_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "block1a_dwconv_DCNN_A", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 32]}, "name": "block1a_dwconv_DCNN_A", "inbound_nodes": [[["stem_activation_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block1a_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 32]}, "name": "block1a_bn_DCNN_A", "inbound_nodes": [[["block1a_dwconv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block1a_activation_DCNN_A", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 32]}, "name": "block1a_activation_DCNN_A", "inbound_nodes": [[["block1a_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "block1a_se_squeeze_DCNN_A", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 32]}, "name": "block1a_se_squeeze_DCNN_A", "inbound_nodes": [[["block1a_activation_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "block1a_se_reshape_DCNN_A", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 32]}, "registered_name": null, "build_config": {"input_shape": [null, 32]}, "name": "block1a_se_reshape_DCNN_A", "inbound_nodes": [[["block1a_se_squeeze_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1a_se_reduce_DCNN_A", "trainable": false, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 32]}, "name": "block1a_se_reduce_DCNN_A", "inbound_nodes": [[["block1a_se_reshape_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1a_se_expand_DCNN_A", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 8]}, "name": "block1a_se_expand_DCNN_A", "inbound_nodes": [[["block1a_se_reduce_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "block1a_se_excite_DCNN_A", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 112, 112, 32], [null, 1, 1, 32]]}, "name": "block1a_se_excite_DCNN_A", "inbound_nodes": [[["block1a_activation_DCNN_A", 0, 0, {}], ["block1a_se_expand_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block1a_project_conv_DCNN_A", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 32]}, "name": "block1a_project_conv_DCNN_A", "inbound_nodes": [[["block1a_se_excite_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block1a_project_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "block1a_project_bn_DCNN_A", "inbound_nodes": [[["block1a_project_conv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2a_expand_conv_DCNN_A", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 16]}, "name": "block2a_expand_conv_DCNN_A", "inbound_nodes": [[["block1a_project_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2a_expand_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 96]}, "name": "block2a_expand_bn_DCNN_A", "inbound_nodes": [[["block2a_expand_conv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2a_expand_activation_DCNN_A", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 96]}, "name": "block2a_expand_activation_DCNN_A", "inbound_nodes": [[["block2a_expand_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "block2a_dwconv_pad_DCNN_A", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 112, 112, 96]}, "name": "block2a_dwconv_pad_DCNN_A", "inbound_nodes": [[["block2a_expand_activation_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "block2a_dwconv_DCNN_A", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 113, 113, 96]}, "name": "block2a_dwconv_DCNN_A", "inbound_nodes": [[["block2a_dwconv_pad_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2a_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "block2a_bn_DCNN_A", "inbound_nodes": [[["block2a_dwconv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2a_activation_DCNN_A", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "block2a_activation_DCNN_A", "inbound_nodes": [[["block2a_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "block2a_se_squeeze_DCNN_A", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "block2a_se_squeeze_DCNN_A", "inbound_nodes": [[["block2a_activation_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "block2a_se_reshape_DCNN_A", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 96]}, "registered_name": null, "build_config": {"input_shape": [null, 96]}, "name": "block2a_se_reshape_DCNN_A", "inbound_nodes": [[["block2a_se_squeeze_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2a_se_reduce_DCNN_A", "trainable": false, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 96]}, "name": "block2a_se_reduce_DCNN_A", "inbound_nodes": [[["block2a_se_reshape_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2a_se_expand_DCNN_A", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 4]}, "name": "block2a_se_expand_DCNN_A", "inbound_nodes": [[["block2a_se_reduce_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "block2a_se_excite_DCNN_A", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 56, 56, 96], [null, 1, 1, 96]]}, "name": "block2a_se_excite_DCNN_A", "inbound_nodes": [[["block2a_activation_DCNN_A", 0, 0, {}], ["block2a_se_expand_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2a_project_conv_DCNN_A", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 96]}, "name": "block2a_project_conv_DCNN_A", "inbound_nodes": [[["block2a_se_excite_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2a_project_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 24]}, "name": "block2a_project_bn_DCNN_A", "inbound_nodes": [[["block2a_project_conv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2b_expand_conv_DCNN_A", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 24]}, "name": "block2b_expand_conv_DCNN_A", "inbound_nodes": [[["block2a_project_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2b_expand_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 144]}, "name": "block2b_expand_bn_DCNN_A", "inbound_nodes": [[["block2b_expand_conv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2b_expand_activation_DCNN_A", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 144]}, "name": "block2b_expand_activation_DCNN_A", "inbound_nodes": [[["block2b_expand_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "block2b_dwconv_DCNN_A", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 144]}, "name": "block2b_dwconv_DCNN_A", "inbound_nodes": [[["block2b_expand_activation_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2b_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 144]}, "name": "block2b_bn_DCNN_A", "inbound_nodes": [[["block2b_dwconv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block2b_activation_DCNN_A", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 144]}, "name": "block2b_activation_DCNN_A", "inbound_nodes": [[["block2b_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "block2b_se_squeeze_DCNN_A", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 144]}, "name": "block2b_se_squeeze_DCNN_A", "inbound_nodes": [[["block2b_activation_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "block2b_se_reshape_DCNN_A", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 144]}, "registered_name": null, "build_config": {"input_shape": [null, 144]}, "name": "block2b_se_reshape_DCNN_A", "inbound_nodes": [[["block2b_se_squeeze_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2b_se_reduce_DCNN_A", "trainable": false, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 144]}, "name": "block2b_se_reduce_DCNN_A", "inbound_nodes": [[["block2b_se_reshape_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2b_se_expand_DCNN_A", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 6]}, "name": "block2b_se_expand_DCNN_A", "inbound_nodes": [[["block2b_se_reduce_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "block2b_se_excite_DCNN_A", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 56, 56, 144], [null, 1, 1, 144]]}, "name": "block2b_se_excite_DCNN_A", "inbound_nodes": [[["block2b_activation_DCNN_A", 0, 0, {}], ["block2b_se_expand_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block2b_project_conv_DCNN_A", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 144]}, "name": "block2b_project_conv_DCNN_A", "inbound_nodes": [[["block2b_se_excite_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block2b_project_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 24]}, "name": "block2b_project_bn_DCNN_A", "inbound_nodes": [[["block2b_project_conv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dropout", "config": {"name": "block2b_drop_DCNN_A", "trainable": false, "dtype": "float32", "rate": 0.025, "noise_shape": [null, 1, 1, 1], "seed": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 24]}, "name": "block2b_drop_DCNN_A", "inbound_nodes": [[["block2b_project_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "block2b_add_DCNN_A", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 56, 56, 24], [null, 56, 56, 24]]}, "name": "block2b_add_DCNN_A", "inbound_nodes": [[["block2b_drop_DCNN_A", 0, 0, {}], ["block2a_project_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block3a_expand_conv_DCNN_A", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 24]}, "name": "block3a_expand_conv_DCNN_A", "inbound_nodes": [[["block2b_add_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block3a_expand_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 144]}, "name": "block3a_expand_bn_DCNN_A", "inbound_nodes": [[["block3a_expand_conv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block3a_expand_activation_DCNN_A", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 144]}, "name": "block3a_expand_activation_DCNN_A", "inbound_nodes": [[["block3a_expand_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "ZeroPadding2D", "config": {"name": "block3a_dwconv_pad_DCNN_A", "trainable": false, "dtype": "float32", "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 56, 56, 144]}, "name": "block3a_dwconv_pad_DCNN_A", "inbound_nodes": [[["block3a_expand_activation_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "block3a_dwconv_DCNN_A", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 59, 59, 144]}, "name": "block3a_dwconv_DCNN_A", "inbound_nodes": [[["block3a_dwconv_pad_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block3a_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 144]}, "name": "block3a_bn_DCNN_A", "inbound_nodes": [[["block3a_dwconv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block3a_activation_DCNN_A", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 144]}, "name": "block3a_activation_DCNN_A", "inbound_nodes": [[["block3a_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "block3a_se_squeeze_DCNN_A", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 144]}, "name": "block3a_se_squeeze_DCNN_A", "inbound_nodes": [[["block3a_activation_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "block3a_se_reshape_DCNN_A", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 144]}, "registered_name": null, "build_config": {"input_shape": [null, 144]}, "name": "block3a_se_reshape_DCNN_A", "inbound_nodes": [[["block3a_se_squeeze_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block3a_se_reduce_DCNN_A", "trainable": false, "dtype": "float32", "filters": 6, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 144]}, "name": "block3a_se_reduce_DCNN_A", "inbound_nodes": [[["block3a_se_reshape_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block3a_se_expand_DCNN_A", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 6]}, "name": "block3a_se_expand_DCNN_A", "inbound_nodes": [[["block3a_se_reduce_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "block3a_se_excite_DCNN_A", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 28, 28, 144], [null, 1, 1, 144]]}, "name": "block3a_se_excite_DCNN_A", "inbound_nodes": [[["block3a_activation_DCNN_A", 0, 0, {}], ["block3a_se_expand_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block3a_project_conv_DCNN_A", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 144]}, "name": "block3a_project_conv_DCNN_A", "inbound_nodes": [[["block3a_se_excite_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block3a_project_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 40]}, "name": "block3a_project_bn_DCNN_A", "inbound_nodes": [[["block3a_project_conv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block3b_expand_conv_DCNN_A", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 40]}, "name": "block3b_expand_conv_DCNN_A", "inbound_nodes": [[["block3a_project_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block3b_expand_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 240]}, "name": "block3b_expand_bn_DCNN_A", "inbound_nodes": [[["block3b_expand_conv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block3b_expand_activation_DCNN_A", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 240]}, "name": "block3b_expand_activation_DCNN_A", "inbound_nodes": [[["block3b_expand_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "DepthwiseConv2D", "config": {"name": "block3b_dwconv_DCNN_A", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "depthwise_regularizer": null, "depthwise_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 240]}, "name": "block3b_dwconv_DCNN_A", "inbound_nodes": [[["block3b_expand_activation_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "block3b_bn_DCNN_A", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 240]}, "name": "block3b_bn_DCNN_A", "inbound_nodes": [[["block3b_dwconv_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "block3b_activation_DCNN_A", "trainable": false, "dtype": "float32", "activation": "swish"}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 240]}, "name": "block3b_activation_DCNN_A", "inbound_nodes": [[["block3b_bn_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "GlobalAveragePooling2D", "config": {"name": "block3b_se_squeeze_DCNN_A", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "registered_name": null, "build_config": {"input_shape": [null, 28, 28, 240]}, "name": "block3b_se_squeeze_DCNN_A", "inbound_nodes": [[["block3b_activation_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "block3b_se_reshape_DCNN_A", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 240]}, "registered_name": null, "build_config": {"input_shape": [null, 240]}, "name": "block3b_se_reshape_DCNN_A", "inbound_nodes": [[["block3b_se_squeeze_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block3b_se_reduce_DCNN_A", "trainable": false, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 240]}, "name": "block3b_se_reduce_DCNN_A", "inbound_nodes": [[["block3b_se_reshape_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block3b_se_expand_DCNN_A", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 1, 10]}, "name": "block3b_se_expand_DCNN_A", "inbound_nodes": [[["block3b_se_reduce_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Multiply", "config": {"name": "block3b_se_excite_DCNN_A", "trainable": false, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 28, 28, 240], [null, 1, 1, 240]]}, "name": "block3b_se_excite_DCNN_A", "inbound_nodes": [[["block3b_activation_DCNN_A", 0, 0, {}], ["block3b_se_expand_DCNN_A", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "block3b_project_conv_DCNN_A", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "VarianceScaling", "config": 